; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	image2 - mode
	image1 - mode
	Star3 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation2 - direction
	Star0 - direction
	Star5 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument2 image2)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 Star5)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(supports instrument3 image2)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument4 image0)
	(supports instrument4 image1)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image2)
	(supports instrument5 image1)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
)
(:goal (and
	(have_image Planet10 image1)
	(have_image Phenomenon11 image1)
	(have_image Star12 image1)
	(have_image Planet13 image0)
	(have_image Planet14 image0)
	(have_image Star15 image0)
	(have_image Star16 image0)
	(have_image Planet17 image1)
))

)

; plan
1. (turn_to satellite1 star5 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star5)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 star5)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 planet14 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet14)
   goals met: 0 of 8
5. (take_image satellite1 planet14 instrument3 image0)
   added: (have_image planet14 image0)
   goals met: 1 of 8
6. (turn_to satellite1 planet13 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet13)
   goals met: 1 of 8
7. (take_image satellite1 planet13 instrument3 image0)
   added: (have_image planet13 image0)
   goals met: 2 of 8
8. (turn_to satellite1 planet10 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet10)
   goals met: 2 of 8
9. (take_image satellite1 planet10 instrument3 image1)
   added: (have_image planet10 image1)
   goals met: 3 of 8
10. (turn_to satellite1 phenomenon11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 8
11. (take_image satellite1 phenomenon11 instrument3 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 8
12. (turn_to satellite1 planet17 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet17)
   goals met: 4 of 8
13. (take_image satellite1 planet17 instrument3 image1)
   added: (have_image planet17 image1)
   goals met: 5 of 8
14. (turn_to satellite1 star12 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star12)
   goals met: 5 of 8
15. (take_image satellite1 star12 instrument3 image1)
   added: (have_image star12 image1)
   goals met: 6 of 8
16. (turn_to satellite1 star15 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star15)
   goals met: 6 of 8
17. (take_image satellite1 star15 instrument3 image0)
   added: (have_image star15 image0)
   goals met: 7 of 8
18. (turn_to satellite1 star16 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star16)
   goals met: 7 of 8
19. (take_image satellite1 star16 instrument3 image0)
   added: (have_image star16 image0)
   goals met: 8 of 8
